In [ ]:
Q1. List any five functions of the pandas library with execution.

In [3]:
import pandas as pd 
df = pd.read_csv("https://raw.githubusercontent.com/datasciencedojo/datasets/master/titanic.csv") 
# to read anny csv file

In [5]:
df.columns
# to get columns of file

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [9]:
df.drop('Survived',axis = 1)

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...
886,887,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [10]:
df.set_index("Name")

,PassengerId,Survived,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
Name,,,,,,,,,,,
"Braund, Mr. Owen Harris",1,0,3,male,22.0,1,0,A/5 21171,7.2500,NaN,S
"Cumings, Mrs. John Bradley (Florence Briggs Thayer)",2,1,1,female,38.0,1,0,PC 17599,71.2833,C85,C
"Heikkinen, Miss. Laina",3,1,3,female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
"Futrelle, Mrs. Jacques Heath (Lily May Peel)",4,1,1,female,35.0,1,0,113803,53.1000,C123,S
"Allen, Mr. William Henry",5,0,3,male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...
"Montvila, Rev. Juozas",887,0,2,male,27.0,0,0,211536,13.0000,NaN,S
"Graham, Miss. Margaret Edith",888,1,1,female,19.0,0,0,112053,30.0000,B42,S
"Johnston, Miss. Catherine Helen ""Carrie""",889,0,3,female,NaN,1,2,W./C. 6607,23.4500,NaN,S
"Behr, Mr. Karl Howell",890,1,1,male,26.0,0,0,111369,30.0000,C148,C
"Dooley, Mr. Patrick",891,0,3,male,32.0,0,0,370376,7.7500,NaN,Q

In [ ]:
pd.DataFrame(d) 
# for create dataframe

In [ ]:
Q2. Given a Pandas DataFrame df with columns 'A', 'B', and 'C', write a Python function to re-index the
DataFrame with a new index that starts from 1 and increments by 2 for each row.

In [13]:
data = {'A': [1, 2, 3], 'B': [4, 5, 6], 'C': [7, 8, 9]}
df = pd.DataFrame(data)

In [14]:
df

   A  B  C
0  1  4  7
1  2  5  8
2  3  6  9

In [15]:
def reindex_dataframe(df):

    new_index = pd.RangeIndex(start=1, stop=len(df) * 2, step=2)
    df_reindexed = df.set_index(new_index)
    return df_reindexed

In [16]:
df_reindexed = reindex_dataframe(df)

In [17]:
df_reindexed

   A  B  C
1  1  4  7
3  2  5  8
5  3  6  9

In [ ]:
Q3. You have a Pandas DataFrame df with a column named 'Values'. Write a Python function that
iterates over the DataFrame and calculates the sum of the first three values in the 'Values' column. The
function should print the sum to the console.

In [27]:
df = pd.DataFrame({'Values': [10, 20, 30, 40, 50],})
def sum_OF_first3value(df):
    first_three_values = df['Values'].head(3)
    sum_of_first_three_values = first_three_values.sum()
    
    print("The sum of the first three values in the 'Values' column is:" , sum_of_first_three_values)

sum_OF_first3value(df)

The sum of the first three values in the 'Values' column is: 60

In [ ]:
Q4. Given a Pandas DataFrame df with a column 'Text', write a Python function to create a new column
'Word_Count' that contains the number of words in each row of the 'Text' column.

In [32]:
import pandas as pd
data = {'Text': ["This is a sample sentence.",
                 "Python programming is fun.",
                 "Data analysis with pandas."]}
df = pd.DataFrame(data)

def add_word_count_column(df):

    df['Word_Count'] = df['Text'].apply(lambda x: len(str(x).split()))

add_word_count_column(df)

print("\nDataFrame with Word_Count column:")
print(df)

DataFrame with Word_Count column:
                         Text  Word_Count
0  This is a sample sentence.           5
1  Python programming is fun.           4
2  Data analysis with pandas.           4

In [ ]:
Q5. How are DataFrame.size() and DataFrame.shape() different?

In [ ]:
DataFrame.size returns the total number of elements in the DataFrame, which is equivalent to the product of the number of 
rows and the number of columns.

DataFrame.shape returns a tuple representing the dimensions of the DataFrame.

In [ ]:
Q6. Which function of pandas do we use to read an excel file?

In [ ]:
df = pd.read_excel()

In [ ]:
Q7. You have a Pandas DataFrame df that contains a column named 'Email' that contains email
addresses in the format 'username@domain.com'. Write a Python function that creates a new column
'Username' in df that contains only the username part of each email address.
The username is the part of the email address that appears before the '@' symbol. For example, if the
email address is 'john.doe@example.com', the 'Username' column should contain 'john.doe'. Your
function should extract the username from each email address and store it in the new 'Username'
column.

In [40]:
import pandas as pd
data = {'email': ["aman@gmail.com","rakesh@gmail.com","manoj@gmail.com"]}
df2 = pd.DataFrame(data)

def username(df2):
    df2['username_s'] = df2['email'].apply(lambda x : x.split('@')[0])
username(df2)

print(df2)

              email username_s
0    aman@gmail.com       aman
1  rakesh@gmail.com     rakesh
2   manoj@gmail.com      manoj

In [ ]:
Q8. You have a Pandas DataFrame df with columns 'A', 'B', and 'C'. Write a Python function that selects
all rows where the value in column 'A' is greater than 5 and the value in column 'B' is less than 10. The
function should return a new DataFrame that contains only the selected rows.
For example, if df contains the following values:
A B C
0 3 5 1
1 8 2 7
2 6 9 4
3 2 3 5
4 9 1 2

Your function should select the following rows: A B C
1 8 2 7
4 9 1 2
The function should return a new DataFrame that contains only the selected rows.

In [47]:
df3 = pd.DataFrame({'A':[3,8,6,2,9],
                   'B':[5,2,9,3,1],
                   'C': [1,7,4,5,2]})
df3
def select_rows(df3):
    selected_rows = df3[(df3['A'] > 5) & (df3['B'] < 10)]
    return selected_rows
    
selected_df = select_rows(df3)
    
print(selected_df)

   A  B  C
1  8  2  7
2  6  9  4
4  9  1  2

In [ ]:
Q9. Given a Pandas DataFrame df with a column 'Values', write a Python function to calculate the mean,
median, and standard deviation of the values in the 'Values' column.

In [48]:
df4 = pd.DataFrame({'values':[3,8,6,2,9]})
df4

   values
0       3
1       8
2       6
3       2
4       9

In [49]:
df4.mean()

values    5.6
dtype: float64

In [50]:
df4.median()

values    6.0
dtype: float64

In [51]:
df4.std()

values    3.04959
dtype: float64

In [ ]:
Q10. Given a Pandas DataFrame df with a column 'Sales' and a column 'Date', write a Python function to
create a new column 'MovingAverage' that contains the moving average of the sales for the past 7 days
for each row in the DataFrame. The moving average should be calculated using a window of size 7 and
should include the current day.

In [52]:
import pandas as pd
df = pd.DataFrame({
  'Date': pd.to_datetime(['2023-12-10', '2023-12-11', '2023-12-12', '2023-12-13', '2023-12-14', '2023-12-15', '2023-12-16']),
  'Sales': [100, 120, 150, 80, 90, 110, 130]
})
def calculate_moving_average(df, window_size=7):
    
    df['MovingAverage'] = df['Sales'].rolling(window=window_size).mean()
    return df

df_with_moving_average = calculate_moving_average(df.copy())

print(df_with_moving_average)

        Date  Sales  MovingAverage
0 2023-12-10    100            NaN
1 2023-12-11    120            NaN
2 2023-12-12    150            NaN
3 2023-12-13     80            NaN
4 2023-12-14     90            NaN
5 2023-12-15    110            NaN
6 2023-12-16    130     111.428571

In [ ]:
column 'Weekday' in the DataFrame. The 'Weekday' column should contain the weekday name (e.g.
Monday, Tuesday) corresponding to each date in the 'Date' column.
For example, if df contains the following values:
Date
0 2023-01-01
1 2023-01-02
2 2023-01-03
3 2023-01-04
4 2023-01-05
Your function should create the following DataFrame:

Date Weekday
0 2023-01-01 Sunday
1 2023-01-02 Monday
2 2023-01-03 Tuesday
3 2023-01-04 Wednesday
4 2023-01-05 Thursday
The function should return the modified DataFrame.

In [56]:
import pandas as pd

def add_weekday_column(df):
    
    df["Weekday_Number"] = df["Date"].dt.weekday
    
    weekday_names = {0: "Sunday", 1: "Monday", 2: "Tuesday", 3: "Wednesday",
                  4: "Thursday", 5: "Friday", 6: "Saturday"}
    df["Weekday"] = df["Weekday_Number"].map(weekday_names)

    df.drop("Weekday_Number", axis=1, inplace=True)

    return df

df = pd.DataFrame({"Date": pd.to_datetime(["2023-01-01", "2023-01-02", "2023-01-03", "2023-01-04", "2023-01-05"])})
df_with_weekdays = add_weekday_column(df.copy())

print(df_with_weekdays)

        Date    Weekday
0 2023-01-01   Saturday
1 2023-01-02     Sunday
2 2023-01-03     Monday
3 2023-01-04    Tuesday
4 2023-01-05  Wednesday

In [ ]:
Q12. Given a Pandas DataFrame df with a column 'Date' that contains timestamps, write a Python
function to select all rows where the date is between '2023-01-01' and '2023-01-31'.

In [60]:
import pandas as pd

data = {'Date': ['2023-01-01', '2023-01-15', '2023-01-20', '2023-02-05', '2023-02-10'],
        'Value': [10, 15, 25, 30, 22]}
df = pd.DataFrame(data)
df

def select_rows_in_date_range(df, start_date, end_date):
    
    df['Date'] = pd.to_datetime(df['Date'])
  
    selected_rows = df[(df['Date'] >= start_date) & (df['Date'] <= end_date)]
    
    return selected_rows


selected_df = select_rows_in_date_range(df, '2023-01-01', '2023-01-31')

print(selected_df)

        Date  Value
0 2023-01-01     10
1 2023-01-15     15
2 2023-01-20     25

In [ ]:
Q13. To use the basic functions of pandas, what is the first and foremost necessary library that needs to
be imported?

In [ ]:
import pandas as p